Codebase/SCB/prism-core/src/main/java/com/ctb/prism/webservice/erTransferobject/NewFile.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:con="http://controller.web.prism.ctb.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <con:erStudentData>
         <StudentList>
            <studentDetails>
               <bioDetails>
                  <dateOfBirth>?</dateOfBirth>
                  <firstName>RILEY</firstName>
                  <gender>M</gender>
                  <lastName>AADSON</lastName>
                  <middleName></middleName>
               </bioDetails>
               <demoDetails>
                  <address1>?</address1>
                  <address2>?</address2>
                  <alternateEmail>?</alternateEmail>
                  <alternateNumber>?</alternateNumber>
                  <attendCollege>?</attendCollege>
                  <cellPhoneNumber>?</cellPhoneNumber>
                  <city>?</city>
                  <contact>?</contact>
                  <county>?</county>
                  <educationLevel>?</educationLevel>
                  <email>?</email>
                  <ethnicity>?</ethnicity>
                  <examineeCcountyParishCode>?</examineeCcountyParishCode>
                  <governmentID>?</governmentID>
                  <governmentIDType>?</governmentIDType>
                  <homeLanguage>?</homeLanguage>
                  <primaryPhoneNumber>?</primaryPhoneNumber>
                  <race>?</race>
                  <registeredAtTestCenter>?</registeredAtTestCenter>
                  <registeredAtTestCenterCode>?</registeredAtTestCenterCode>
                  <registeredBy>?</registeredBy>
                  <registeredOn>?</registeredOn>
                  <state>?</state>
                  <zip>?</zip>
               </demoDetails>
               
               <orgDetails>
                  <stateCode>?</stateCode>
                  <stateName>?</stateName>
                  <cTBCustomerID>?</cTBCustomerID>
               </orgDetails>
               
               <scheduleList>
                  <scheduleDetails>
                     <barcode></barcode>
                     <contentAreaCode>?</contentAreaCode>
                     <contentTestCode>?</contentTestCode>
                     <contentTestType>PBT</contentTestType>
                     <dateCheckedIn>?</dateCheckedIn>
                     <dateScheduled>?</dateScheduled>
                     <ECC>?</ECC>
                     <form>?</form>
                     <scheduleID>?</scheduleID>
                     <testCenterCode>?</testCenterCode>
                     <testCenterName>?</testCenterName>
                     <timeOfDay>?</timeOfDay>
                     <tASCReadiness>?</tASCReadiness>
                  </scheduleDetails>
                  <scheduleDetails>
                     <barcode></barcode>
                     <contentAreaCode>?</contentAreaCode>
                     <contentTestCode>?</contentTestCode>
                     <contentTestType>CBT</contentTestType>
                     <dateCheckedIn>?</dateCheckedIn>
                     <dateScheduled>?</dateScheduled>
                     <ECC>?</ECC>
                     <form>?</form>
                     <scheduleID>?</scheduleID>
                     <testCenterCode>?</testCenterCode>
                     <testCenterName>?</testCenterName>
                     <timeOfDay>?</timeOfDay>
                     <tASCReadiness>?</tASCReadiness>
                  </scheduleDetails>
               </scheduleList>
               <UUID>12345678</UUID>
            </studentDetails>
            
            <studentDetails>
               <bioDetails>
                  <dateOfBirth>?</dateOfBirth>
                  <firstName>AMANDA</firstName>
                  <gender>M</gender>
                  <lastName>AARDEMA</lastName>
                  <middleName></middleName>
               </bioDetails>
               <demoDetails>
                  <address1>?</address1>
                  <address2>?</address2>
                  <alternateEmail>?</alternateEmail>
                  <alternateNumber>?</alternateNumber>
                  <attendCollege>?</attendCollege>
                  <cellPhoneNumber>?</cellPhoneNumber>
                  <city>?</city>
                  <contact>?</contact>
                  <county>?</county>
                  <educationLevel>?</educationLevel>
                  <email>?</email>
                  <ethnicity>?</ethnicity>
                  <examineeCcountyParishCode>?</examineeCcountyParishCode>
                  <governmentID>?</governmentID>
                  <governmentIDType>?</governmentIDType>
                  <homeLanguage>?</homeLanguage>
                  <primaryPhoneNumber>?</primaryPhoneNumber>
                  <race>?</race>
                  <registeredAtTestCenter>?</registeredAtTestCenter>
                  <registeredAtTestCenterCode>?</registeredAtTestCenterCode>
                  <registeredBy>?</registeredBy>
                  <registeredOn>?</registeredOn>
                  <state>?</state>
                  <zip>?</zip>
               </demoDetails>
               
               <orgDetails>
                  <stateCode>?</stateCode>
                  <stateName>?</stateName>
                  <cTBCustomerID>?</cTBCustomerID>
               </orgDetails>
               
               <scheduleList>
                  <scheduleDetails>
                     <barcode>1234</barcode>
                     <contentAreaCode>?</contentAreaCode>
                     <contentTestCode>?</contentTestCode>
                     <contentTestType>PBT</contentTestType>
                     <dateCheckedIn>?</dateCheckedIn>
                     <dateScheduled>?</dateScheduled>
                     <ECC>?</ECC>
                     <form>?</form>
                     <scheduleID>?</scheduleID>
                     <testCenterCode>?</testCenterCode>
                     <testCenterName>?</testCenterName>
                     <timeOfDay>?</timeOfDay>
                     <tASCReadiness>?</tASCReadiness>
                  </scheduleDetails>
                  <scheduleDetails>
                     <barcode></barcode>
                     <contentAreaCode>?</contentAreaCode>
                     <contentTestCode>?</contentTestCode>
                     <contentTestType>CBT</contentTestType>
                     <dateCheckedIn>?</dateCheckedIn>
                     <dateScheduled>?</dateScheduled>
                     <ECC>?</ECC>
                     <form>?</form>
                     <scheduleID>?</scheduleID>
                     <testCenterCode>?</testCenterCode>
                     <testCenterName>?</testCenterName>
                     <timeOfDay>?</timeOfDay>
                     <tASCReadiness>?</tASCReadiness>
                  </scheduleDetails>
               </scheduleList>
               <UUID></UUID>
            </studentDetails>
         </StudentList>
      </con:erStudentData>
   </soapenv:Body>
</soapenv:Envelope>